tutorials/multiphase/waves/waveSolver/squarePile/constant/waveProperties.input
/*---------------------------------------------------------------------------*
Caelus 7.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          environmentalProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel	0.0;

relaxationNames      (inlet);

initializationName inlet;

inletCoeffs
{
    waveType	potentialCurrent;
    Tsoft       0;
    U           (0.5 0 1);
    
    relaxationZone
    {
        relaxationScheme Spatial;
        relaxationShape  Cylindrical;
        beachType        Empty;

        rInner           30;
        rOuter           40;
        centre           (0 0 0);
    }
}



// ************************************************************************* //
